In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kumaw\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kumaw\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kumaw\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kumaw\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kumaw\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\kumaw\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
a = pd.Series([1,2,3,4,5,6,7,8,9,10])
print(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [11]:
a={
    "Emp_Id" : [1,2,3,4,5,6,7,8],
    "Name": ['sam','Raj','Nidhi','Ankit','Sam','pallavi','Garvit','sam'],
    "department":['It','Sales','It','Sales','It','operations','sales','It'],
    "Working_hours": [8,9,9,9,8,9,8,9]
}

In [8]:
type(a)

dict

In [12]:
df = pd.DataFrame(a)
df

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2      Raj       Sales              9
2       3    Nidhi          It              9
3       4    Ankit       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [14]:
df.to_csv("C:\\Users\\kumaw\\OneDrive\\Desktop\\pd1\\emp_info.csv", index=False)

In [15]:
df1 =pd.read_csv("C:\\Users\\kumaw\\OneDrive\\Desktop\\pd1\\emp_info.csv")

In [16]:
df1

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2      Raj       Sales              9
2       3    Nidhi          It              9
3       4    Ankit       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [17]:
df2 = pd.read_csv("emp_info.csv")
df2

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2      Raj       Sales              9
2       3    Nidhi          It              9
3       4    Ankit       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [18]:
df.head()
#top five data

   Emp_Id   Name department  Working_hours
0       1    sam         It              8
1       2    Raj      Sales              9
2       3  Nidhi         It              9
3       4  Ankit      Sales              9
4       5    Sam         It              8

In [19]:
df.head(2)
#top two data

   Emp_Id Name department  Working_hours
0       1  sam         It              8
1       2  Raj      Sales              9

In [21]:
df.tail()
#last five data

   Emp_Id     Name  department  Working_hours
3       4    Ankit       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [22]:
df.tail(3)
#last two data

   Emp_Id     Name  department  Working_hours
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [25]:
df.sample(3)
#random data

   Emp_Id   Name department  Working_hours
0       1    sam         It              8
7       8    sam         It              9
2       3  Nidhi         It              9

In [24]:
df.shape

(8, 4)

In [26]:
df.columns

Index(['Emp_Id', 'Name', 'department', 'Working_hours'], dtype='object')